In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
world_pop = pd.read_csv("./../../data/outsrc/API_SP.POP.TOTL_DS2_en_csv_v2_10058048.csv")

In [4]:
world_pop = world_pop.loc[:,("Country Name", "2014")]
world_pop = world_pop.rename({"2014": "2014 Population"}, axis = "columns")
world_pop = world_pop.dropna(how="any")

In [5]:
world_pop.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 262 entries, 0 to 263
Data columns (total 2 columns):
Country Name       262 non-null object
2014 Population    262 non-null float64
dtypes: float64(1), object(1)
memory usage: 6.1+ KB

### Import DataFrame

In [6]:
statistics2017 = pd.read_csv("./../../data/sample/2017.statistics.sample.with_missing_cities_continents.csv")
statistics2017 = statistics2017.rename({"DOI": "Downloads"}, axis = "columns")
statistics2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 11 columns):
Downloads     1500000 non-null object
IPID          1500000 non-null int64
city          1394066 non-null object
country       1468489 non-null object
date          1500000 non-null object
is_oa         1480851 non-null object
lat           1386787 non-null float64
lon           1386787 non-null float64
userID        1500000 non-null int64
continent     1467987 non-null object
DOI_prefix    1500000 non-null float64
dtypes: float64(3), int64(2), object(6)
memory usage: 125.9+ MB

In [9]:
table1 = statistics2017.loc[statistics2017.continent == "Oceania",("country","Downloads")].groupby(['country']).count().sort_values(by='Downloads',ascending = False).head(15)
table1

                          Downloads
country
Australia                      6041
New Zealand                    1053
New Caledonia                    80
Fiji                             42
French Polynesia                 36
Guam                             26
Papua New Guinea                  9
Vanuatu                           4
Northern Mariana Islands          1
Solomon Islands                   1
Tonga                             1

In [8]:
table2 = statistics2017.loc[statistics2017.continent == "Oceania",("country","city","Downloads")].groupby(['country','city']).count().sort_values(by='Downloads',ascending = False).head(15)
table2

                             Downloads
country       city
Australia     Melbourne            620
New Zealand   Auckland             602
Australia     Sydney               558
              Alexandria           400
              Hornsby              317
              Brisbane City        189
              Adelaide             176
              Perth                163
              Brighton East         85
              Hobart                78
              Monash                77
              Barangaroo            74
              Clayton               73
New Caledonia Noumea                66
New Zealand   Christchurch          63

In [7]:
print (table2.to_latex())

\begin{tabular}{llr}
\toprule
            &              &  Downloads \\
country & city &            \\
\midrule
Australia & Melbourne &        620 \\
New Zealand & Auckland &        602 \\
Australia & Sydney &        558 \\
            & Alexandria &        400 \\
            & Hornsby &        317 \\
            & Brisbane City &        189 \\
            & Adelaide &        176 \\
            & Perth &        163 \\
            & Brighton East &         85 \\
            & Hobart &         78 \\
            & Monash &         77 \\
            & Barangaroo &         74 \\
            & Clayton &         73 \\
New Caledonia & Noumea &         66 \\
New Zealand & Christchurch &         63 \\
\bottomrule
\end{tabular}